app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
      <i class="fa fa-heart" aria-hidden="true" style="color: pink;"></i>
      <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
      <i class="fa fa-heart" aria-hidden="true" style="color: blue;"></i>
      <%= book.favorites.count %>