app/views/users/_index.html.erb

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."user_id" = ?  [["user_id", 1]]
---

        <td><p>フォロー数：<%= user.relationships.count %></p></td>