app/views/users/_info.html.erb

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 3], ["follow_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."user_id" = ?  [["user_id", 1]]
---
    <th>follows</th>
    <th><%= link_to user.relationships.count, follows_user_path(user.id) %></th>

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follow_id" = ?  [["follow_id", 1]]
---
    <th>followers</th>
    <th><%= link_to user.reverse_of_relationships.count, followers_user_path(user.id) %></th>