app/controllers/groups_controller.rb

INSERT INTO "group_users" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 1], ["user_id", 1], ["created_at", "2021-06-09 07:25:55.047975"], ["updated_at", "2021-06-09 07:25:55.047975"]]
---
    def new
        @group = Group.new
        @group.users << current_user

INSERT INTO "groups" ("name", "introduction", "image_id", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "べべ"], ["introduction", "べべ"], ["image_id", nil], ["owner_id", 4], ["created_at", "2021-06-10 08:57:36.521003"], ["updated_at", "2021-06-10 08:57:36.521003"]]
---
    def create
        @group = Group.new(group_params)
        if @group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "groups" SET "introduction" = ?, "image_id" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["introduction", "べべbe"], ["image_id", nil], ["updated_at", "2021-06-10 13:17:52.675195"], ["id", 11]]
---
    def update
        @group = Group.find(params[:id])
        if @group.update(group_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 2]]
---
    def destroy
        delete_group = Group.find(params[:id])
        if delete_group.destroy